import React from 'react';
import '../../App.css';
import Cards from '../Cards';
import HeroSection from '../HeroSection';
import Footer from '../Footer';

function Page_3() {
  return (
    <>
              <div className='hero-container'>
      <video src={'/videos/v8.mp4'} autoPlay loop muted />

      <h1>Чому варто купляти ліцензійні ігри?</h1>
 
      </div>
<div className='cards'>
       
       <img src='images/page_3/i1.jpg'  />
       <h3>13.06.2022.</h3>
      <p  className='footer-subscription-heading' >
      Всім доброго дня! Я довго думав як описати і подати дану проблему, тому що вона стосується не лише людей із розвинутих країн, або країн із великими можливостями для «піратства», а й нас – молодого українського покоління.       </p>
       <img src='images/page_3/i2.jpg'  />
       <p className='footer-subscription-text'>
       Сьогодні я хочу поговорити з вами на тему ліцензійних ігор, що, безсумнівно, є однією з найболючіших тем українського ґеймера, та, зрештою, розставити всі точки над і.
<br></br>
То чи варто купляти ліцензійні ігри, чи ж все ж таки по-традиційному завантажувати «піратки» із торент-трекерів або дисків?  <h2>Звичайно, відповідь – варто.</h2>     </p>

       <p className='footer-subscription-text'>
       Насамперед, кожна купівля ліцензійної гри, це чи не єдиний спосіб отримати працівникам свою платню за довгу та клопітку працю. Як ви знаєте, майже усі проекти завжди шукають спонсорів, які б погодились вкласти свої гроші з розрахунком, що гра окупиться. Тому, якщо інвестиційний фонд закінчується, а грошей від продажу ігор так і не має, або надходить в малій кількості, часто така компанія банкротує, або залізає в борги. У такому випадку творці, професійні розробники йдуть з команди і гра втрачає свою якість та унікальність. Якщо ж це велика компанія, то вона значно зменшує фінансування на певний проект, тим самим ставить під загрозу якість ґеймплею та самої «картинки» наступного продукту. Скачуючи «піратку», ви тим самим зменшуєте вірогідність випуску нової, кращої «забавки».       </p>
       <img src='images/page_3/i3.jpg'  />
        <p className='footer-subscription-text '>
        Коли ви купляєте якусь гру, ви платите гроші усім тим, хто приклався до проекту. Тим самим ви забезпечуєте процвітання та випуск нових, кращих продуктів. Таким чином, якщо проект принесе прибуток для розробників, в них появиться мотивація творити ще цікавіші, ще якісніші ігри, а це – порадує усіх ґеймерів.
<br></br>
<br></br>
Головним критерієм ліцензійної гри – є її наповненість, додавання усіх відповідний роликів, DLC та нових оновлень, доповнень. В то час «піратки» завжди, або майже завжди мають особливість незакінченості, при цьому при завантаженні нового, оновленого продукту ніхто не дає гарантії про збереження усіх save-файлів.
<br></br>
<br></br>
Купляючи певний продукт, у вас самих появляється певний стимул проходити дану «забавку», розібратися у всьому. На противагу цьому – «розбещений пірат» завжди може перебирати між іграми, тим самим він ніколи не задовільняється, шукає чогось нового, тратить свій час на марно.
<br></br>
<br></br>
Власне, затративши певну суму грошей, ви назавжди отримуєте продукт, що оновлюється та в якому, по мірі можливостей, виправляють різного типу помилки. Одним із найважливіших факторів являється можливість мультиплеєру при покупці ліцензійної гри, якого не можна собі дозволити у звичайній «піратці».
<br></br>
<br></br>
Останнім пунктом, що може вас насторожити – величезна кількість вірусів, які витають у чи не кожному взломаному файлі чи програмі. Різноманітні активатори, «кряки» змушують нас відключати антивіруси, і мало хто знає, до яких проблем це може призвести.        
</p>

<p className='footer-subscription-text '>
<h2>Якщо немає достатньо коштів?</h2>
Кожен може заперечити усе сказане вище єдиною проблемою – нестачею коштів. І це не дивне, а цілком нормальне явище, особливо у наш час, коли рідко знаходять зайві гроші на ігри.
<br></br>
На допомогу приходять знижки та суперціни, розпродажі, що проводяться на честь певних свят, чи особливих днів у кожному із магазинів ліцензійних ігор.
<br></br>
Тому уважно слідкуйте за усіма подіями та не проґавте можливість придбати гру по вигідній вам ціні. Таким чином ви  зекономите, і, більше того, перестанете завантажувати «піратки»
<br></br>
Не забувайте, разом – ми сила. І якщо більша частина українців відмовиться від «піраток», це завдасть сильного удару по усьому нелегальному ринку і прокладе дорогу в щасливе майбутнє.
<br></br>
На останок, я прошу вас лише про одну послугу: уважно обдумайте кожен пункт даної статті та прийміть власне рішення. Від вас, як і від десятків тисяч інших залежить уся подальша доля усієї ґеміндустрії.
</p>
      </div>
      <Footer />
    </>
  );
}

export default Page_3;
/*function Page_1() {
  return (
    <div className='hero-container'>
      <video src={'/videos/v4.mp4'} autoPlay loop muted />
      <h1>Home3</h1>

    </div>
    
  );
  
}
*/
//export default Page_1;


