import React from 'react';
import '../../App.css';
import Cards from '../Cards';
import HeroSection from '../HeroSection';
import Footer from '../Footer';

function Page_1() {
  return (
    <>
      <div className='hero-container'>
      <video src={'/videos/v6.mp4'} autoPlay loop muted />
      <h1>Роль лінійки ігор Sim`s та вплив на ігрову культуру</h1>
      </div>
      <div className='cards'>
       
       <img src='images/page_1/i9.jpg'  />
       <h3>11.06.2022.</h3>
      <p  className='footer-subscription-heading' >
         The Sims є серією відеоігри моделювання життя - - розроблений Максис і опубліковано від Електронне мистецтво. Франшиза продана майже у 200 мільйонів примірників у всьому світі, і це одна з найбільш продаваних серій відеоігор усіх часів.
Ігри в Sims серії значною мірою ігри пісочниців тому, що їм не вистачає певних цілей (за винятком деяких пізніших пакетів розширення та консолі версії, які ввели цей стиль гри). Гравець створює віртуальних людей, яких називають "симами", розміщує їх у будинках і допомагає керувати їх настроями та задовольняти їх бажання. Гравці можуть або розмістити своїх симів у зведених будинках, або побудувати їх самостійно. Кожен наступний розширювальний пакет і гра в серії доповнила те, що гравець міг робити зі своїми симами.
The Sims серія є частиною більшої Сим серії, розпочато користувачем SimCity у 1989 році. 
       </p>
       <img src='images/page_1/i1.jpg'  />
       <p className='footer-subscription-text'>
       «The Sims» використовує комбінацію 3D та 2D графіки. Самі сіми є 3D-моделями, тоді як будинок і всі об'єкти є пререндерованими і розташовані діаметрально. Камера гри знаходиться у 2D ізометрії.
Гра зосереджена навколо сімів — людей, які живуть в СімСіті, розмовляють на сімліші та використовують валюту під назвою сімолен.
Ігровий процес знаходиться у трьох режимах: режим життя, режим будування та режим покупок. З початком гри сім'я отримує § 20,000 сімолеонів. Цей бюджет можна використати на купівлю вільного маленького будинку, який доступний в Районі. Після того як було придбано будинок, його можна перебудувати чи підкорегувати в режимі будування та розташувати меблі, декорування, освітлення та прибори для проживання. Всі об'єкти, окрім стін, парканів та шпалер розміщуються в центрі ігрових клітинок. Базова гра містить у собі біля 150 об'єктів.
       </p>
       <p className='footer-subscription-text'>
       Ігровий дизайнер Уілл Райт був натхненний створити "віртуальний ляльковий будинок" після втрати свого будинку під час Оклендська вогняна буря 1991 року а згодом відбудувавши своє життя. Заміна свого будинку та іншого майна змусила його задуматися про адаптацію цього життєвого досвіду до гри. Коли Райт спочатку передав свої ідеї Максиму рада директорів, вони були скептично налаштовані і не надавали грошей на підтримку чи фінансування. Директори в Електронне мистецтво, які придбали Maxis в 1997 році, були більш сприйнятливими -SimCity мав для них великий успіх, і вони передбачали можливість побудови сильної Сим франшиза.
Райт заявив про це The Sims насправді малося на увазі як сатира на США споживча культура. Райт взяв ідеї з архітектури 1977 р. І міський дизайн книга Мова-візерунок, Американський психолог Абрахам МаслоуПапір 1943 року Теорія мотивації людини і його ієрархія потреб, і Чарльз Хемпден-Тернер's Карти розуму розробити модель для гри штучний інтелект.
       </p>
       <img src='images/page_1/i2.jpg'  />
        <p className='footer-subscription-text '>
        Успіх The Sims призвело до Рекорди Гіннеса нагороджуючи серію численними світовими рекордами, включаючи станом на 2017 рік "Найбільші пакети розширень для серії відеоігор" та "Найпопулярніша серія ігор для ПК", оцінка продажів становить від 36 до 50 мільйонів одиниць. Станом на жовтень 2019 року The Sims комбіновані ігри генерували за весь період життя продажі більше ніж Доларів США 5 млрд.
        </p>

      </div>
      <Footer />
    </>
  );
}

export default Page_1;
/*function Page_1() {
  return (
    <div className='hero-container'>
      <video src={'/videos/v4.mp4'} autoPlay loop muted />
      <h1>Home3</h1>

    </div>
    
  );
  
}
*/
//export default Page_1;


