import React from 'react';
import '../../App.css';
import Cards from '../Cards';
import HeroSection from '../HeroSection';
import Footer from '../Footer';

function Page_6() {
  return (
    <>
      <div className='hero-container'>
      <video src={'/videos/v11.mp4'} autoPlay loop muted />
      <h1>South Park: The Fractured but Whole</h1>
      </div>
      <div className='cards'>
       <h1>Огляд South Park: The Fractured but Whole. Сам пожартував, сам посміявся</h1>
       <img src='images/page_6/png1.jpg'  />
       <h3>16.06.2022.</h3>
      <p  className='footer-subscription-heading' >
      South Park: The Fractured but Whole схожа на дуже старанну копію попередниці. Сильно змінилася лише бойова система: на місце варіації на тему японських RPG прийшла система а-ля «Герої меча та магії» . Розбите на клітини поле, чотири персонажі (іноді за сюжетом трапляється, що й один). Ходимо в межах зони, наносимо пошкодження, застосовуємо спеціальні прийоми і в результаті перемагаємо або починаємо все спочатку. Деякі атаки ворогів поділені на дві фази, у цьому випадку головне - підгадати момент і вивести партію з-під вогню (теж нововведення). У відповідь б'ємо, пускаємо гази, змушуючи опонентів блювати, знову б'ємо. Найсмішніше, що навіть у такому варіанті система з The Fractured but Whole набагато розумніша і глибша за попередницю.       </p>
       <img src='images/page_6/png2.jpg'  />
       <p className='footer-subscription-text'>
       «Проблема тут в іншому: інтерактивної версії «Південного парку» і не потрібна була продумана бойовка. Мета битв у пародійних іграх – розсмішити та відвернути від квестової складової. Але в сиквелі «Палиці істини» все зовсім не так: через нововведення навіть випадкова сутичка з шестикласником здатна затягтися на непристойну кількість часу - особливо для тих, хто ніколи раніше жанром не захоплювався, але дуже любить мультсеріал. І це на низькому чи середньому рівні складності! А на високому починається справжній хардкор, якого тут зовсім не чекаєш.
Так само як не чекаєш і продуманої системи прокачування. І ми зараз не про дев'ять класів персонажів із їхніми унікальними атаками — мова суто про артефакти, які дозволяють значно посилити Чмо. Бажаєте, щоб здоров'я відновлювалося швидше? Посилення можна зібрати з підручних предметів (тобто буквально з гівна та палиць — є навіть однойменне ачивка), можливих комбінацій — темрява.       </p>
<img src='images/page_6/png3.jpg'  />
       <p className='footer-subscription-text'>
       Такий підхід прекрасний у всьому, якщо ми говоримо про велику, серйозну рольову казку. Але інтерактивний "Південний парк" - птах зовсім іншого польоту. The Fractured but Whole вдається розважати, але гра нічого не втратила б, відмовиться її автори від накручування механіки. Навіщо, чорт забирай, в історії про те, як діти вирішили стати супергероями, містити зайві проблеми? Їй-богу, мало нам Ni no Kuni  з її безглуздим гріндом було! Зрозуміло, що там про сперму і лайно не жартували, але сюжет теж був далекий від рольової механіки.      </p>
       <p className='footer-subscription-text '>
       <img src='images/page_6/gif.jpg'  /> Той рідкісний випадок, коли автори гри наплювали на галас у пресі та соціальних мережах. Рівень складності позначається кольором шкіри героя.
        </p>
       
        <p className='footer-subscription-text '>
        <h2>З життя міста</h2> <br></br>
Цікаво вивчати саме оточення: вирішувати простенькі головоломки за допомогою газів, заходити до будинків жителів міста, брати загалом терпимі другорядні квести — ситуація приблизно як із першою частиною.
На жаль, головна проблема (і вона ж за сумісництвом гідність) — надмірна участь Паркера та Стоуна у розробці сіквела. У South Park: The Fractured but Whole кількість хохм про гівно, блювоту, чоловіче насіння та метеоризм заходить за всі мислимі та немислимі межі. The Stick of Truth, звичайно, теж не могла похвалитися відсутністю сортирних тем, але там вони здорово розбавлялися просто гумором: жерсть подавалася дуже помірковано, а сцену з анальним зондом взагалі викинули з європейського релізу. У грі від внутрішньої студії Ubisoft подібним балансом не пахне.      </p>
<img src='images/page_6/gif2.jpg'  />
<p className='footer-subscription-text '>
      <h2>Висновок</h2> <br></br> <br></br>
      Разом з тим, це все одно дуже цікава історія, гідна того, щоб називатися ще одним епізодом «Південного парку» (так, це комплімент). Поступово стартова сюжетна зав'язка з пошуком кота переростає в зовсім іншу площину: гра буквально глузує з прагнення Голлівуду перенести на великі мультисвітові екрани Marvel і DC. Втім, і просто шизи тут вистачає з лишком. Улюблені персонажі – у комплекті.
        </p>
      </div>
      <Footer />
    </>
  );
}

export default Page_6;
/*function Page_1() {
  return (
    <div className='hero-container'>
      <video src={'/videos/v4.mp4'} autoPlay loop muted />
      <h1>Home3</h1>

    </div>
    
  );
  
}
*/
//export default Page_1;


