import React from 'react';
import '../../App.css';
import Cards from '../Cards';
import HeroSection from '../HeroSection';
import Footer from '../Footer';
/*export default function Page_2() {
  return <h1 className='sign-up'>Home & 4</h1>;
}*/
/*
function Page_2() {
  return (
    <div className='hero-container'>
      <video src={'/videos/v5.mp4'} autoPlay loop muted />
      <h1>Home4</h1>

    </div>
  );
}

export default Page_2;
*/
function Page_2() {
  return (
    <>
              <div className='hero-container'>
      <video src={'/videos/v7.mp4'} autoPlay loop muted />

      <h1>Чому варто купляти ліцензійні ігри?</h1>
 
      </div>
      <div className='cards'>

      <h1>ЧОМУ ВІДЕОІГРИ НАС ТАК ЧІПЛЯЮТЬ І ЧИ ВАРТО ЦЬОГО БОЯТИСЯ?</h1>
       <img className='' src='images/page_2/gif.jpg'/> 
       <h3>12.06.2022.</h3>
        <p className='footer-subscription-heading'>
           Ігровій індустрії всього 60 з невеликим років, і за цей час вона пройшла шлях від примітивних ігор до створення цілого віртуального світу. Популярність ігор величезна: наприклад, тільки за перший тиждень карантину загальні продажі тайтлів найбільших компаній підскочили на 63% порівняно з тижнем до локдауну, а кількість активних геймерів у світі до 2021 вже досягла позначки 2,5 мільярдів.
        Редакція IgroManiac вирішили з'ясувати, як відеоігри стали такими популярними і чому від них неможливо відірватися. 
        </p>
        <br></br>
        <p className='footer-subscription-text'>
       ЗАНУРЕННЯ — ЦЕ ПЕВНИЙ СТАН СВІДОМОСТІ, В ЯКОМУ ГРАВЕЦЬ ЧАСТКОВО АБО ЦІЛКОМ ВТРАЧАЄ ЗВ'ЯЗОК ІЗ ЗОВНІШНІМ СВІТОМ, ЗАГЛИБЛЮЮЧИСЬ У ВІРТУАЛЬНИЙ.Для повного занурення повинні бути залучені всі органи чуття: зір, слух, смак, нюх і дотик (тактильний зв'язок з віртуальним світом).

В ігровій індустрії виділяють сім різновидів занурення в ігрову реальність. Про них і поговоримо.
       </p>
        <img src='images/page_2/gif2.jpg'  />
       <p className='footer-subscription-text'>
       ТАКТИЧНЕ ЗАНУРЕННЯ <br></br>
Іншими словами — прорахунок алгоритму дій, які приводять гравця до успіху. Подібного занурення можна досягти, виконуючи тактичні операції, які вимагають від учасника певної вправности: спритности, влучности і швидкої реакції. Успішно виконуючи кожну задачу, гравець усе більше занурюється в ігровий світ.
       </p>
       <img src='images/page_2/i9.jpg'  />
       <p className='footer-subscription-text'>
       СТРАТЕГІЧНЕ
ЗАНУРЕННЯ <br></br>Тут все трохи складніше — стратегічне занурення вимагає інтелектуального підходу до завдання. Тільки вирішуючи розумові проблеми у грі, можна досягти повного занурення в процес. Це легко можна простежити, спостерігаючи за шахістами під час вирішальної партії — вони так зосереджені на своїй інтелектуальній задачі, що зовнішній світ перестає для них існувати.
       </p>
       <img src='images/page_2/gif3.jpg'  />
        <p className='footer-subscription-text '>
        РОЗПОВІДНЕ
ЗАНУРЕННЯ <br></br>Якщо раніше гравець користувався своїм набутими скілом — інтелектом або вмінням швидко реагувати на подразники, — то в розповідному зануренні важливо абстрагуватися від реальності і цілком заглибитися в історію на екрані. Герой перебуває в моменті, а сюжет веде його за собою. Подібне занурення відчувають ті, хто сильно захоплений цікавою книгою.

Джон Рональд Роуел Толкін у своєму есе «Про чарівні казки» писав: «Я вважаю, втеча від дійсності — одна з основних функцій чарівної казки, і оскільки я схвально ставлюся до всіх її функцій, то, природно, не згоден з тим жалісним і призирним тоном, яким слово "ескапізм" часто вимовляють».
        </p>
        <img src='images/page_2/gif4.jpg'  />
        <p className='footer-subscription-text '>
        ЕМОЦІЙНЕ
ЗАНУРЕННЯ <br></br>Якщо «посвячення» героя вже сталося і він відчув на собі перші наслідки занурення в ігрову реальність (перейнявся сюжетом, почав вирішувати інтелектуальні і тактичні завдання), далі йде емоційне занурення. Геймер починає співпереживати персонажу й відчувати емоції, які той міг би відчувати. Згадайте, як ви дивилися «Титанік» і переживали за Джека Доусона або як плакали, коли Хатіко залишився на вокзалі чекати свого господаря. В іграх те ж саме — тільки сильніше.
        </p>
        <img src='images/page_2/gif5.jpg'  />
        <p className='footer-subscription-text '>
        ПСИХОЛОГІЧНЕ
ЗАНУРЕННЯ<br></br> Це перехід свідомості геймера до його персонажа в комп'ютерній грі, при якому відчуття тіла в реальному світі зберігається. Так гравець отримує можливість проживати паралельне життя, опиняючись перед новим психологічним і емоційним досвідом. А це, зрештою, може допомогти відчути й історії реальних людей.

       </p>

<h2>Висновок <br></br>Занурення в ігрову реальність допомагає поліпшити багато навичок, зокрема й краще адаптуватися до реального світу. Тож недооцінювати плюси відеоігор не варто, так само як і боятися, що в цю реальність затягне з головою.</h2>


      </div>
      <Footer />
    </>
  );
}

export default Page_2;